app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-10-16 23:22:27.351564"], ["updated_at", "2018-10-16 23:22:27.351564"]]
---
  def create
    @schoolclass = SchoolClass.create(params[:school_class])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @schoolclass = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-10-16 23:51:48.256228"], ["id", 1]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @schoolclass = SchoolClass.find(params[:id])