app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-10-16 23:33:00.358089"], ["updated_at", "2018-10-16 23:33:00.358089"]]
---
  def create
    @student = Student.create(params[:student])